create table board02(
num int auto_increment primary key,
writer varchar(20),
subject varchar(30),
writerPw varchar(20),
reg_date datetime default now(),
readcount int default 0,
content varchar(1000),
id varchar(20)board02board
);

drop table board02;

INSERT INTO board02 (writer, subject, writerPw, content, id) VALUES
('홍길동', '첫 번째 게시글입니다', '1234', '내용입니다 1', 'user1'),
('김철수', '두 번째 게시글입니다', '1234', '내용입니다 2', 'user2'),
('이영희', '세 번째 게시글입니다', '1234', '내용입니다 3', 'user3'),
('박민수', '네 번째 게시글입니다', '1234', '내용입니다 4', 'user4'),

('홍길동', '게시판 테스트 글 5', '1234', '내용입니다 5', 'user1'),
('김철수', '게시판 테스트 글 6', '1234', '내용입니다 6', 'user2'),
('이영희', '게시판 테스트 글 7', '1234', '내용입니다 7', 'user3'),
('박민수', '게시판 테스트 글 8', '1234', '내용입니다 8', 'user4'),

('홍길동', '페이징 테스트 9', '1234', '내용입니다 9', 'user1'),
('김철수', '페이징 테스트 10', '1234', '내용입니다 10', 'user2'),
('이영희', '페이징 테스트 11', '1234', '내용입니다 11', 'user3'),
('박민수', '페이징 테스트 12', '1234', '내용입니다 12', 'user4'),

('홍길동', '페이징 테스트 13', '1234', '내용입니다 13', 'user1'),
('김철수', '페이징 테스트 14', '1234', '내용입니다 14', 'user2'),
('이영희', '페이징 테스트 15', '1234', '내용입니다 15', 'user3'),
('박민수', '페이징 테스트 16', '1234', '내용입니다 16', 'user4'),

('홍길동', '마지막 테스트 17', '1234', '내용입니다 17', 'user1'),
('김철수', '마지막 테스트 18', '1234', '내용입니다 18', 'user2'),
('이영희', '마지막 테스트 19', '1234', '내용입니다 19', 'user3'),
('박민수', '마지막 테스트 20', '1234', '내용입니다 20', 'user4');